components.templates.name=j-lawyer.org Vorlagenpaket
components.server.name=j-lawyer.org Server
components.backupmgr.name=j-lawyer.org Backupmanager

components.j-lawyer-server.description=j-lawyer.org Server Binaries, Startdatei, Tools und Bibliotheken
screens.mysqlinstall.title=Installation von MySQL
screens.mysqlinstall.subtitle=Sie k\u00F6nnen MySQL automatisch installieren lassen oder eine vorhandene Installation ausw\u00E4hlen.
screens.mysqlinstall.progress.title=Konfiguriere MySQL...
screens.mysqlinstall.progress.subtitle=Bitte warten Sie w\u00E4hrend MySQL konfiguriert wird.
screens.mysqlinstall.uselocal=bereits vorhandenes MySQL nutzen
screens.mysqlinstall.install=neues MySQL automatisch installieren
screens.mysqlinstall.selectpath=Pfad zur mysql.exe:
screens.mysqlinstall.linuxhint.subtitle=Hinweise zur manuellen Installation von MySQL auf Linux
screens.mysqlinstall.linuxhint=MySQL wurde automatisch heruntergeladen. Bitte f\u00FChren Sie folgende Datei aus:
screens.mysqlinstall.machint.subtitle=Hinweise zur manuellen Installation von MySQL auf Mac OS X
screens.mysqlinstall.machint=MySQL wurde automatisch heruntergeladen. Bitte installieren Sie folgende Datei:
screens.mysqlinstall.machint.s1=F\u00FChren Sie die Datei durch Doppelklick aus
screens.mysqlinstall.machint.s2=F\u00FChren Sie das darin enthaltene Package (.pkg) durch Doppelklick aus
screens.mysqlinstall.machint.s3=Es \u00F6ffnet sich der Installer-Dialog, mit 'Continue' beginnt die Installation
screens.mysqlinstall.machint.s4=In folgenden Schritten nutzen Sie die Standardeinstellungen (Zielverzeichnis nicht \u00E4ndern, Installation f\u00FCr alle Nutzer, alle Komponenten installieren). Sofern bei der Installation ein Passwort vergeben wird, notieren Sie sich dieses.
screens.mysqlinstall.machint.s5=Nach erfolgreicher Installation den Dialog mit 'Close' schliessen
screens.mysqlinstall.machint.s6=MySQL ist nach Installation noch nicht gestartet. \u00D6ffnen Sie die Mac OS Systemeinstellungen und w\u00E4hlen Sie dort 'MySQL'. Aktivieren Sie den automatischen Start und klicken Sie abschlie\u00DFend 'Start MySQL Server'. Schliessen Sie die Einstellungen.
screens.mysqlinstall.machint.s7=\u00D6ffnen Sie ein Terminal und geben Sie nacheinander folgende Befehle ein:<br/><pre>cd /usr/local/mysql/bin</pre><br/><pre>./mysqladmin -u root -p password</pre><br/> Sie werden zuerst nach dem bisherigen MySQL-Password gefragt - geben Sie hier das notierte Passwort ein, oder ENTER wenn keines vergeben wurde. Jetzt muss zwei mal das neue Passwort eingegeben werden. Vergeben Sie ein Passwort mit mindestens 8 Zeichen, und beschr\u00E4nken Sie sich auf die Zeichen A-Z a-z 0-9. Das neue Passwort wird im weiteren Verlauf ben\u00F6tigt - bitte ebenfalls notieren.
screens.mysqlinstall.machint.s8=Schliessen Sie das Terminal und f\u00FChren Sie die j-lawyer.org-Installation fort.
screens.mysqlinstall.users.title=MySQL-Nutzer
screens.mysqlinstall.users.subtitle=Folgende MySQL-Nutzer wurden angelegt:
screens.mysqlinstall.users.hint=Bitte notieren Sie sich diese Zugangsdaten und verwahren Sie sie an einem sicheren Ort. Sie werden sp\u00E4ter f\u00FCr die Installation von Updates ben\u00F6tigt und sollten in den Datensicherungseinstellungen hinterlegt werden.
screens.mysqlselectlocal.description=Geben Sie das Passwort des MySQL-Nutzers "root" des lokal laufenden MySQL-Servers ein.
screens.mysqlselectlocal.root=root-Passwort:
screens.mysqlselectlocal.rootconfirm=best\u00E4tigen:
screens.mysqlselectlocal.rootmismatch=Eingaben stimmen nicht \u00FCberein!
screens.mysqldata.subtitle=Es ist bereits ein MySQL-Datenverzeichnis vorhanden. Das kann zu Problemen f\u00FChren (bspw. kann kein neues root-Passwort gesetzt werden).
screens.mysqldata.rename=Es gibt keine anderen installierten Applikationen die MySQL nutzen. Das vorhande Verzeichnis sichern und ein neues anlegen.
screens.mysqldata.ignore=Ignorieren - es wird kein neues Datenverzeichnis angelegt. M\u00F6glicherweise schl\u00E4gt die Installation fehl.


screens.service.title=j-lawyer.org Serviceinstallation
screens.service.subtitle=Der j-lawyer.org Server kann als Dienst installiert und automatisch gestartet werden, oder vor jeder Nutzung manuell gestartet werden.
screens.service.manualstart=manuelles Starten und Stoppen
screens.service.servicestart=automatisches Starten und Stoppen (Installation als Dienst)

error.download.mysql=MySQL konnte nicht heruntergeladen werden. Stellen Sie sicher da\u00DF eine Internetverbindung besteht.
error.install.mysql=MySQL konnte nicht installiert werden. Bitte nutzen Sie das j-lawyer.org Forum und beschreiben Sie die Schritte, die zu diesem Problem gef\u00FChrt haben.
error.uselocal.mysql=MySQL kann im angegebenen Verzeichnis nicht gefunden werden.
msg.install.mysql=Konfiguriere MySQL...
